using System;
using System.Runtime.ExceptionServices;
using System.Runtime.InteropServices;
using System.Security;
using MonkeyWorks.Unmanaged.Headers;
using MonkeyWorks.Unmanaged.Libraries;

#pragma warning disable 169

namespace MonkeyWorks.Unmanaged.Libraries.DInvoke
{
    public sealed class ntdll
    {
        [StructLayout(LayoutKind.Sequential, Pack = 8)]
        public struct _CURDIR
        {
            public Ntddk._UNICODE_STRING DosPath;
            public IntPtr Handle;

        }

        [StructLayout(LayoutKind.Sequential, Pack = 1)]
        public struct _IO_STATUS_BLOCK
        {
            public uint Status;
            public IntPtr Information;
        }

        [StructLayout(LayoutKind.Sequential)]
        public struct _FILE_DISPOSITION_INFORMATION
        {
            public bool DeleteFile;
        }

        [Flags]
        public enum _FILE_INFORMATION_CLASS
        {
            FileDirectoryInformation = 1,
            FileFullDirectoryInformation,                   // 2
            FileBothDirectoryInformation,                   // 3
            FileBasicInformation,                           // 4
            FileStandardInformation,                        // 5
            FileInternalInformation,                        // 6
            FileEaInformation,                              // 7
            FileAccessInformation,                          // 8
            FileNameInformation,                            // 9

            uint Length,
            Wnf._WNF_TYPE_ID TypeId,
            IntPtr ExplicitScope,
            [MarshalAs(UnmanagedType.U4)]
            int MatchingChangeStamp,
            [MarshalAs(UnmanagedType.Bool)]
            bool CheckChangeStamp
        );

        [UnmanagedFunctionPointer(CallingConvention.StdCall)]
        [return: MarshalAs(UnmanagedType.U4)]
        public delegate uint NtWaitForSingleObject(
            IntPtr Handle,
            [MarshalAs(UnmanagedType.Bool)]
            bool Alertable,
            [MarshalAs(UnmanagedType.U4)]
            uint Timeout
        );

        [UnmanagedFunctionPointer(CallingConvention.StdCall)]
        [return: MarshalAs(UnmanagedType.U4)]
        public delegate uint NtWriteFile(
            IntPtr FileHandle,
            IntPtr Event,
            IntPtr ApcRoutine,
            IntPtr ApcContext,
            ref _IO_STATUS_BLOCK IoStatusBlock,
            IntPtr Buffer,
            [MarshalAs(UnmanagedType.U8)]
            ulong Length,
            ref Winnt.LARGE_INTEGER ByteOffset,
            [MarshalAs(UnmanagedType.U8)]
            ref ulong Key
        );

        [UnmanagedFunctionPointer(CallingConvention.StdCall)]
        [return: MarshalAs(UnmanagedType.U4)]
        public delegate uint NtWriteVirtualMemory(
            IntPtr ProcessIntPtr,
            IntPtr BaseAddress,
            IntPtr Buffer,
            ulong NumberOfBytesToWrite,
            ref ulong NumberOfBytesWritten
        );

        [StructLayout(LayoutKind.Sequential)]
        public struct T_CLIENT_ID
        {
            public IntPtr UniqueProcess;
            public IntPtr UniqueThread;
        }

        [StructLayout(LayoutKind.Sequential)]
        public struct T_RTLP_PROCESS_REFLECTION_REFLECTION_INFORMATION
        {
            public IntPtr ReflectionProcessHandle;
            public IntPtr ReflectionThreadHandle;
            public T_CLIENT_ID ReflectionClientId;
        }

        public const uint RTL_CLONE_PROCESS_FLAGS_CREATE_SUSPENDED = 0x00000001;
        public const uint RTL_CLONE_PROCESS_FLAGS_INHERIT_HANDLES = 0x00000002;
        public const uint RTL_CLONE_PROCESS_FLAGS_NO_SYNCHRONIZE = 0x00000004;

        [UnmanagedFunctionPointer(CallingConvention.StdCall)]
        [return: MarshalAs(UnmanagedType.U4)]
        public delegate uint RtlCreateProcessReflection(
            IntPtr ProcessHandle,
            uint Flags,
            IntPtr StartRoutine,
            IntPtr StartContext,
            IntPtr EventHandle,
            out T_RTLP_PROCESS_REFLECTION_REFLECTION_INFORMATION ReflectionInformation
        );

        [UnmanagedFunctionPointer(CallingConvention.StdCall)]
        [return: MarshalAs(UnmanagedType.U4)]
        public delegate uint RtlNtStatusToDosError([MarshalAs(UnmanagedType.U4)] uint Status);

        [StructLayout(LayoutKind.Explicit, Size = 0x7a0)]
        public struct PEB
        {
            [FieldOffset(0x000)] public byte InheritedAddressSpace;
            [FieldOffset(0x001)] public byte ReadImageFileExecOptions;
            [FieldOffset(0x002)] public byte BeingDebugged;
            [FieldOffset(0x003)] public byte BitField;
            [FieldOffset(0x004)] public /*fixed*/ byte Padding0;//[4];
            [FieldOffset(0x008)] public IntPtr Mutant;
            [FieldOffset(0x010)] public IntPtr ImageBaseAddress;
            [FieldOffset(0x018)] public IntPtr Ldr;
            [FieldOffset(0x020)] public IntPtr ProcessParameters;
            [FieldOffset(0x028)] public IntPtr SubSystemData;
            [FieldOffset(0x030)] public IntPtr ProcessHeap;
            [FieldOffset(0x038)] public IntPtr FastPebLock;
            [FieldOffset(0x040)] public IntPtr AtlThunkSListPtr;
            [FieldOffset(0x048)] public IntPtr IFEOKey;
            [FieldOffset(0x050)] public uint CrossProcessFlags;
            [FieldOffset(0x054)] public /*fixed*/ byte Padding1;//[4];
            [FieldOffset(0x058)] public IntPtr KernelCallbackTable;
            [FieldOffset(0x058)] public IntPtr UserSharedInfoPtr;
            [FieldOffset(0x060)] public /*fixed*/ uint SystemReserved;//[1];
            [FieldOffset(0x064)] public uint AtlThunkSListPtr32;
            [FieldOffset(0x068)] public IntPtr ApiSetMap;
            [FieldOffset(0x070)] public uint TlsExpansionCounter;
            [FieldOffset(0x074)] public /*fixed*/ byte Padding2;//[4];
            [FieldOffset(0x078)] public IntPtr TlsBitmap;
            [FieldOffset(0x080)] public /*fixed*/ uint TlsBitmapBits;//[2];
            [FieldOffset(0x088)] public IntPtr ReadOnlySharedMemoryBase;
            [FieldOffset(0x090)] public IntPtr SparePvoid0;
            [FieldOffset(0x098)] public IntPtr ReadOnlyStaticServerData;
            [FieldOffset(0x0a0)] public IntPtr AnsiCodePageData;
            [FieldOffset(0x0a8)] public IntPtr OemCodePageData;
            [FieldOffset(0x0b0)] public IntPtr UnicodeCaseTableData;
            [FieldOffset(0x0b8)] public uint NumberOfProcessors;
            [FieldOffset(0x0bc)] public uint NtGlobalFlag;
            [FieldOffset(0x0c0)] public long CriticalSectionTimeout;
            [FieldOffset(0x0c8)] public ulong HeapSegmentReserve;
            [FieldOffset(0x0d0)] public ulong HeapSegmentCommit;
            [FieldOffset(0x0d8)] public ulong HeapDeCommitTotalFreeThreshold;
            [FieldOffset(0x0e0)] public ulong HeapDeCommitFreeBlockThreshold;
            [FieldOffset(0x0e8)] public uint NumberOfHeaps;
            [FieldOffset(0x0ec)] public uint MaximumNumberOfHeaps;
            [FieldOffset(0x0f0)] public IntPtr ProcessHeaps;
            [FieldOffset(0x0f8)] public IntPtr GdiSharedHandleTable;
            [FieldOffset(0x100)] public IntPtr ProcessStarterHelper;
            [FieldOffset(0x108)] public uint GdiDCAttributeList;
            [FieldOffset(0x10c)] public /*fixed*/ byte Padding3;//[4];
            [FieldOffset(0x110)] public IntPtr LoaderLock;
            [FieldOffset(0x118)] public uint OSMajorVersion;
            [FieldOffset(0x11c)] public uint OSMinorVersion;
            [FieldOffset(0x120)] public ushort OSBuildNumber;
            [FieldOffset(0x122)] public ushort OSCSDVersion;
            [FieldOffset(0x124)] public uint OSPlatformId;
            [FieldOffset(0x128)] public uint ImageSubsystem;
            [FieldOffset(0x12c)] public uint ImageSubsystemMajorVersion;
            [FieldOffset(0x130)] public uint ImageSubsystemMinorVersion;
            [FieldOffset(0x134)] public /*fixed*/ byte Padding4;//[4];
            [FieldOffset(0x138)] public ulong ActiveProcessAffinityMask;
            [FieldOffset(0x140)] public /*fixed*/ uint GdiHandleBuffer;//[60];
            [FieldOffset(0x230)] public IntPtr PostProcessInitRoutine;
            [FieldOffset(0x238)] public IntPtr TlsExpansionBitmap;
            [FieldOffset(0x240)] public /*fixed*/ uint TlsExpansionBitmapBits;//[32];
            [FieldOffset(0x2c0)] public uint SessionId;
            [FieldOffset(0x2c4)] public /*fixed*/ byte Padding5;//[4];
            [FieldOffset(0x2c8)] public ulong AppCompatFlags;
            [FieldOffset(0x2d0)] public ulong AppCompatFlagsUser;
            [FieldOffset(0x2d8)] public IntPtr pShimData;
            [FieldOffset(0x2e0)] public IntPtr AppCompatInfo;
            [FieldOffset(0x2e8)] public Ntddk._UNICODE_STRING CSDVersion;
            [FieldOffset(0x2f8)] public IntPtr ActivationContextData;
            [FieldOffset(0x300)] public IntPtr ProcessAssemblyStorageMap;
            [FieldOffset(0x308)] public IntPtr SystemDefaultActivationContextData;
            [FieldOffset(0x310)] public IntPtr SystemAssemblyStorageMap;
            [FieldOffset(0x318)] public ulong MinimumStackCommit;
            [FieldOffset(0x320)] public IntPtr FlsCallback;
            [FieldOffset(0x328)] public Winnt._LIST_ENTRY FlsListHead;
            [FieldOffset(0x338)] public IntPtr FlsBitmap;
            [FieldOffset(0x340)] public /*fixed*/ uint FlsBitmapBits;//[4];
            [FieldOffset(0x350)] public uint FlsHighIndex;
            [FieldOffset(0x358)] public IntPtr WerRegistrationData;
            [FieldOffset(0x360)] public IntPtr WerShipAssertPtr;
            [FieldOffset(0x368)] public IntPtr pUnused;
            [FieldOffset(0x370)] public IntPtr pImageHeaderHash;
            [FieldOffset(0x378)] public uint TracingFlags;
            [FieldOffset(0x37c)] public /*fixed*/ byte Padding6;//[4];
            [FieldOffset(0x380)] public ulong CsrServerReadOnlySharedMemoryBase;
            [FieldOffset(0x388)] public ulong TppWorkerpListLock;
            [FieldOffset(0x390)] public Winnt._LIST_ENTRY TppWorkerpList;
            [FieldOffset(0x3a0)] public IntPtr WaitOnAddressHashTable;


            public bool ImageUsesLargePages => (BitField & 0x0001) >> 0 == 1;
            public bool IsProtectedProcess => (BitField & 0x0002) >> 1 == 1;
            public bool IsImageDynamicallyRelocated => (BitField & 0x0004) >> 2 == 1;
            public bool SkipPatchingUser32Forwarders => (BitField & 0x0008) >> 3 == 1;
            public bool IsPackagedProcess => (BitField & 0x0010) >> 4 == 1;
            public bool IsAppContainer => (BitField & 0x0020) >> 5 == 1;
            public bool IsProtectedProcessLight => (BitField & 0x0040) >> 6 == 1;
            public bool SpareBits => (BitField & 0x0080) >> 7 == 1;

            public bool ProcessInJob => (CrossProcessFlags & 0x0001) >> 0 == 1;
            public bool ProcessInitializing => (CrossProcessFlags & 0x0002) >> 1 == 1;
            public bool ProcessUsingVEH => (CrossProcessFlags & 0x0004) >> 2 == 1;
            public bool ProcessUsingVCH => (CrossProcessFlags & 0x0008) >> 3 == 1;
            public bool ProcessUsingFTH => (CrossProcessFlags & 0x0010) >> 4 == 1;
            public uint ReservedBits0 => ((CrossProcessFlags & 0xFFFFFFE0) >> 5);

            public bool HeapTracingEnabled => (TracingFlags & 0x0001) >> 0 == 1;
            public bool CritSecTracingEnabled => (TracingFlags & 0x0002) >> 1 == 1;
            public bool LibLoaderTracingEnabled => (TracingFlags & 0x0004) >> 2 == 1;
            public uint SpareTracingBits => ((TracingFlags & 0xFFFFFFF8) >> 3);

        }

        [StructLayout(LayoutKind.Sequential, Pack = 1)]
        public struct _PROCESS_ACCESS_TOKEN
        {
            public IntPtr hToken;
            public IntPtr hThread;
        }

        [Flags]
        public enum _PROCESS_INFORMATION_CLASS
        {
            ProcessBasicInformation = 0,
            ProcessQuotaLimits,
            ProcessIoCounters,
            ProcessVmCounters,
            ProcessTimes,
            ProcessBasePriority,
            ProcessRaisePriority,
            ProcessDebugPort,
            ProcessExceptionPort,
            ProcessAccessToken,
            ProcessLdtInformation,
            ProcessLdtSize,
            ProcessDefaultHardErrorMode,
            ProcessIoPortIntPtrrs,
            ProcessPooledUsageAndLimits,
            ProcessWorkingSetWatch,
            ProcessUserModeIOPL,
            ProcessEnableAlignmentFaultFixup,
            ProcessPriorityClass,
            ProcessWx86Information,
            ProcessIntPtrCount,
            ProcessAffinityMask,
            ProcessPriorityBoost,
            ProcessDeviceMap,
            ProcessSessionInformation,
            ProcessForegroundInformation,
            ProcessWow64Information,
            ProcessImageFileName,
            ProcessLUIDDeviceMapsEnabled,
            ProcessBreakOnTermination,
            ProcessDebugObjectIntPtr,
            ProcessDebugFlags,
            ProcessIntPtrTracing,
            ProcessIoPriority,
            ProcessExecuteFlags,
            ProcessTlsInformation,
            ProcessCookie,
            ProcessImageInformation,
            ProcessCycleTime,
            ProcessPagePriority,
            ProcessInstrumentationCallback,
            ProcessThreadStackAllocation,
            ProcessWorkingSetWatchEx,
            ProcessImageFileNameWin32,
            ProcessImageFileMapping,
            ProcessAffinityUpdateMode,
            ProcessMemoryAllocationMode,
            ProcessGroupInformation,
            ProcessTokenVirtualizationEnabled,
            ProcessConsoleHostProcess,
            ProcessWindowInformation,
            MaxProcessInfoClass,
            ProcessProtectionInformation = 61
        }

        [StructLayout(LayoutKind.Sequential, Pack = 8)]
        public struct _PROCESS_BASIC_INFORMATION
        {
            public readonly IntPtr Reserved1;
            public IntPtr PebBaseAddress;
            public readonly IntPtr AffinityMask;
            public readonly IntPtr BasePriority;
            public UIntPtr UniqueProcessId;
            public readonly IntPtr Reserved3;
        }

        struct _PEB_LDR_DATA
        {
            ulong Length;
            bool Initialized;
            IntPtr SsHandle;
            Winnt._LIST_ENTRY InLoadOrderModuleList;               // Points to the loaded modules (main EXE usually)
            Winnt._LIST_ENTRY InMemoryOrderModuleList;             // Points to all modules (EXE and all DLLs)
            Winnt._LIST_ENTRY InInitializationOrderModuleList;
            IntPtr EntryInProgress;

        }

        [StructLayout(LayoutKind.Sequential, Pack = 1)]
        public struct CURDIR
        {
            public Ntddk._UNICODE_STRING DosPath;
            public IntPtr Handle;

        }

        /*
        [UnmanagedFunctionPointer(CallingConvention.StdCall)]
        [return: MarshalAs(UnmanagedType.U4)]
        public delegate uint RtlCreateProcessParametersEx(
            out IntPtr pProcessParameters,
            IntPtr ImagePathName,
            IntPtr DllPath,
            IntPtr CurrentDirectory,
            IntPtr CommandLine,
            IntPtr Environment,
            IntPtr WindowTitle,
            IntPtr DesktopInfo,
            IntPtr ShellInfo,
            IntPtr RuntimeData,
            [MarshalAs(UnmanagedType.U4)] uint Flags
        );
        */

        [UnmanagedFunctionPointer(CallingConvention.StdCall)]
        [return: MarshalAs(UnmanagedType.U4)]
        public delegate uint RtlCreateProcessParametersEx(
            out IntPtr pProcessParameters,
            ref Ntddk._UNICODE_STRING ImagePathName,
            ref Ntddk._UNICODE_STRING DllPath,
            ref Ntddk._UNICODE_STRING CurrentDirectory,
            ref Ntddk._UNICODE_STRING CommandLine,
            IntPtr Environment,
            ref Ntddk._UNICODE_STRING WindowTitle,
            ref Ntddk._UNICODE_STRING DesktopInfo,
            ref Ntddk._UNICODE_STRING ShellInfo,
            ref Ntddk._UNICODE_STRING RuntimeData,
            [MarshalAs(UnmanagedType.U4)] uint Flags
        );

        [UnmanagedFunctionPointer(CallingConvention.StdCall)]
        [return: MarshalAs(UnmanagedType.U4)]
        public delegate uint RtlCreateUserThread(
            IntPtr processHandle, 
            IntPtr threadSecurity, 
            [MarshalAs(UnmanagedType.Bool)]
            bool createSuspended, 
            [MarshalAs(UnmanagedType.U8)]
            uint stackZeroBits, 
            [MarshalAs(UnmanagedType.U8)]
            ref ulong stackReserved,
            [MarshalAs(UnmanagedType.U8)]
            ref ulong stackCommit,
            [MarshalAs(UnmanagedType.U8)]
            ref ulong startAddress, 
            IntPtr parameter, 
            ref IntPtr threadHandle, 
            IntPtr clientId
        );

        [UnmanagedFunctionPointer(CallingConvention.StdCall)]
        [return: MarshalAs(UnmanagedType.U4)]
        public delegate uint RtlReportSilentProcessExit(
            IntPtr processHandle, 
            [MarshalAs(UnmanagedType.U4)]
            uint exitStatus
        );


        [Flags]
        public enum _OBJECT_INFORMATION_CLASS : int
        {
            ObjectBasicInformation,
            ObjectNameInformation,
            ObjectTypeInformation,
            ObjectTypesInformation,
            ObjectHandleFlagInformation,
            ObjectSessionInformation,
            ObjectSessionObjectInformation,
            MaxObjectInfoClass
        }

        [StructLayout(LayoutKind.Sequential)]
        public struct _PUBLIC_OBJECT_TYPE_INFORMATION
        {
            public Ntddk._UNICODE_STRING TypeName;
            [MarshalAs(UnmanagedType.ByValArray, SizeConst = 22)]
            ulong[] Reserved;
        }

        [StructLayout(LayoutKind.Explicit, Size = 0x18)]
        public struct _RTL_DRIVE_LETTER_CURDIR
        {
            [FieldOffset(0x000)] public ushort Flags;
            [FieldOffset(0x002)] public ushort Length;
            [FieldOffset(0x004)] public uint TimeStamp;
            [FieldOffset(0x008)] public _STRING DosPath;

        }

        /*
        [StructLayout(LayoutKind.Explicit, Size = 0x410)]
        public struct RTL_USER_PROCESS_PARAMETERS
        {
            [FieldOffset(0x000)] public uint MaximumLength;
            [FieldOffset(0x004)] public uint Length;
            [FieldOffset(0x008)] public uint Flags;
            [FieldOffset(0x00c)] public uint DebugFlags;
            [FieldOffset(0x010)] public IntPtr ConsoleHandle;
            [FieldOffset(0x018)] public uint ConsoleFlags;
            [FieldOffset(0x020)] public IntPtr StandardInput;
            [FieldOffset(0x028)] public IntPtr StandardOutput;
            [FieldOffset(0x030)] public IntPtr StandardError;
            [FieldOffset(0x038)] public _CURDIR CurrentDirectory;
            [FieldOffset(0x050)] public Ntddk._UNICODE_STRING DllPath;
            [FieldOffset(0x060)] public Ntddk._UNICODE_STRING ImagePathName;
            [FieldOffset(0x070)] public Ntddk._UNICODE_STRING CommandLine;
            [FieldOffset(0x080)] public IntPtr Environment;
            [FieldOffset(0x088)] public uint StartingX;
            [FieldOffset(0x08c)] public uint StartingY;
            [FieldOffset(0x090)] public uint CountX;
            [FieldOffset(0x094)] public uint CountY;
            [FieldOffset(0x098)] public uint CountCharsX;
            [FieldOffset(0x09c)] public uint CountCharsY;
            [FieldOffset(0x0a0)] public uint FillAttribute;
            [FieldOffset(0x0a4)] public uint WindowFlags;
            [FieldOffset(0x0a8)] public uint ShowWindowFlags;
            [FieldOffset(0x0b0)] public Ntddk._UNICODE_STRING WindowTitle;
            [FieldOffset(0x0c0)] public Ntddk._UNICODE_STRING DesktopInfo;
            [FieldOffset(0x0d0)] public Ntddk._UNICODE_STRING ShellInfo;
            [FieldOffset(0x0e0)] public Ntddk._UNICODE_STRING RuntimeData;
            [FieldOffset(0x0f0)] public RTL_DRIVE_LETTER_CURDIR CurrentDirectores0;
            [FieldOffset(0x108)] public RTL_DRIVE_LETTER_CURDIR CurrentDirectores1;
            [FieldOffset(0x120)] public RTL_DRIVE_LETTER_CURDIR CurrentDirectores2;
            [FieldOffset(0x138)] public RTL_DRIVE_LETTER_CURDIR CurrentDirectores3;
            [FieldOffset(0x150)] public RTL_DRIVE_LETTER_CURDIR CurrentDirectores4;
            [FieldOffset(0x168)] public RTL_DRIVE_LETTER_CURDIR CurrentDirectores5;
            [FieldOffset(0x180)] public RTL_DRIVE_LETTER_CURDIR CurrentDirectores6;
            [FieldOffset(0x198)] public RTL_DRIVE_LETTER_CURDIR CurrentDirectores7;
            [FieldOffset(0x1b0)] public RTL_DRIVE_LETTER_CURDIR CurrentDirectores8;
            [FieldOffset(0x1c8)] public RTL_DRIVE_LETTER_CURDIR CurrentDirectores9;
            [FieldOffset(0x1e0)] public RTL_DRIVE_LETTER_CURDIR CurrentDirectores10;
            [FieldOffset(0x1f8)] public RTL_DRIVE_LETTER_CURDIR CurrentDirectores11;
            [FieldOffset(0x210)] public RTL_DRIVE_LETTER_CURDIR CurrentDirectores12;
            [FieldOffset(0x228)] public RTL_DRIVE_LETTER_CURDIR CurrentDirectores13;
            [FieldOffset(0x240)] public RTL_DRIVE_LETTER_CURDIR CurrentDirectores14;
            [FieldOffset(0x258)] public RTL_DRIVE_LETTER_CURDIR CurrentDirectores15;
            [FieldOffset(0x270)] public RTL_DRIVE_LETTER_CURDIR CurrentDirectores16;
            [FieldOffset(0x288)] public RTL_DRIVE_LETTER_CURDIR CurrentDirectores17;
            [FieldOffset(0x2a0)] public RTL_DRIVE_LETTER_CURDIR CurrentDirectores18;
            [FieldOffset(0x2b8)] public RTL_DRIVE_LETTER_CURDIR CurrentDirectores19;
            [FieldOffset(0x2d0)] public RTL_DRIVE_LETTER_CURDIR CurrentDirectores20;
            [FieldOffset(0x2e8)] public RTL_DRIVE_LETTER_CURDIR CurrentDirectores21;
            [FieldOffset(0x300)] public RTL_DRIVE_LETTER_CURDIR CurrentDirectores22;
            [FieldOffset(0x318)] public RTL_DRIVE_LETTER_CURDIR CurrentDirectores23;
            [FieldOffset(0x330)] public RTL_DRIVE_LETTER_CURDIR CurrentDirectores24;
            [FieldOffset(0x348)] public RTL_DRIVE_LETTER_CURDIR CurrentDirectores25;
            [FieldOffset(0x360)] public RTL_DRIVE_LETTER_CURDIR CurrentDirectores26;
            [FieldOffset(0x378)] public RTL_DRIVE_LETTER_CURDIR CurrentDirectores27;
            [FieldOffset(0x390)] public RTL_DRIVE_LETTER_CURDIR CurrentDirectores28;
            [FieldOffset(0x3a8)] public RTL_DRIVE_LETTER_CURDIR CurrentDirectores29;
            [FieldOffset(0x3c0)] public RTL_DRIVE_LETTER_CURDIR CurrentDirectores30;
            [FieldOffset(0x3d8)] public RTL_DRIVE_LETTER_CURDIR CurrentDirectores31;
            [FieldOffset(0x3f0)] public ulong EnvironmentSize;
            [FieldOffset(0x3f8)] public ulong EnvironmentVersion;
            [FieldOffset(0x400)] public IntPtr PackageDependencyData;
            [FieldOffset(0x408)] public uint ProcessGroupId;
            [FieldOffset(0x40c)] public uint LoaderThreads;

        }
        */

        [StructLayout(LayoutKind.Sequential, Pack = 4)]
        public struct _RTL_USER_PROCESS_PARAMETERS
        {
            public uint MaximumLength;
            public uint Length;
            public uint Flags;
            public uint DebugFlags;
            public IntPtr ConsoleHandle;
            public ulong ConsoleFlags;
            public IntPtr StandardInput;
            public IntPtr StandardOutput;
            public IntPtr StandardError;
            public _CURDIR CurrentDirectory;
            public Ntddk._UNICODE_STRING DllPath;
            public Ntddk._UNICODE_STRING ImagePathName;
            public Ntddk._UNICODE_STRING CommandLine;
            public IntPtr Environment;
            public uint StartingPositionLeft;
            public uint StartingPositionTop;
            public uint Width;
            public uint Height;
            public uint CharWidth;
            public uint CharHeight;
            public uint ConsoleTextAttributes;
            public uint WindowFlags;
            public uint ShowWindowFlags;
            public uint Reserved;
            public Ntddk._UNICODE_STRING WindowTitle;
            public Ntddk._UNICODE_STRING DesktopName;
            public Ntddk._UNICODE_STRING ShellInfo;
            public Ntddk._UNICODE_STRING RuntimeData;
            [MarshalAs(UnmanagedType.ByValArray, SizeConst = 0x20)]
            public _RTL_DRIVE_LETTER_CURDIR[] CurrentDirectories;//[0x20];
            public ulong EnvironmentSize;
        }

        [StructLayout(LayoutKind.Explicit, Size = 0x10)]
        public struct _STRING
        {
            [FieldOffset(0x000)] public ushort Length;
            [FieldOffset(0x002)] public ushort MaximumLength;
            [FieldOffset(0x008)] public IntPtr Buffer; //ref IntPtr*

        }

        [StructLayout(LayoutKind.Sequential, Pack = 1)]
        public struct SYSTEM_HANDLE_TABLE_ENTRY_INFO
        { // Information Class 16
            public int ProcessID;
            public byte ObjectTypeNumber;
            public byte Flags; // 0x01 = PROTECT_FROM_CLOSE, 0x02 = INHERIT
            public ushort Handle;
            public int Object_Pointer;
            public uint GrantedAccess;
        }

        [StructLayout(LayoutKind.Sequential, Pack = 1)]
        public struct _SYSTEM_HANDLE_TABLE_ENTRY_INFO
        {
            public ushort UniqueProcessId;
            public ushort CreatorBackTraceIndex;
            public byte ObjectTypeIndex;
            public byte HandleAttributes;
            public ushort HandleValue;
            public IntPtr Object;
            public ulong GrantedAccess;
        }

        [StructLayout(LayoutKind.Sequential)]
        public struct SYSTEM_HANDLE_INFORMATION
